#### PANDAS BASIC

In [2]:
import pandas as pd
label=['AAPL','GOOG','AMZN','TSLA']
list1=['stock#1','stock#2','stock#3','stock#4']
s=pd.Series(data=list1,index=label)
s

AAPL    stock#1
GOOG    stock#2
AMZN    stock#3
TSLA    stock#4
dtype: object

In [7]:
type(s)

pandas.core.series.Series

In [8]:
df=pd.DataFrame({'Bank customer id':[111,222,333,444],
                'Bank customer name':['Steve','Ryan','Mitch','Chanel'],
                'Net worth [$]':[250000,6890,6543,70000],
                'Years with bank':[3,4,9,5]})
df

   Bank customer id Bank customer name  Net worth [$]  Years with bank
0               111              Steve         250000                3
1               222               Ryan           6890                4
2               333              Mitch           6543                9
3               444             Chanel          70000                5

#### READ HTML

In [10]:
house=pd.read_html('https://www.livingin-canada.com/house-prices-canada.html')
house[0]

,City,Average House Price,12 Month Change
0,"Vancouver, BC","$1,036,000",+ 2.63 %
1,"Toronto, Ont","$870,000",+10.2 %
2,"Ottawa, Ont","$479,000",+ 15.4 %
3,"Calgary, Alb","$410,000",– 1.5 %
4,"Montreal, Que","$435,000",+ 9.3 %
5,"Halifax, NS","$331,000",+ 3.6 %
6,"Regina, Sask","$254,000",– 3.9 %
7,"Fredericton, NB","$198,000",– 4.3 %
8,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...

In [11]:
house[1]

,Province,Average House Price,12 Month Change
0,British Columbia,"$736,000",+ 7.6 %
1,Ontario,"$594,000",– 3.2 %
2,Alberta,"$353,000",– 7.5 %
3,Quebec,"$340,000",+ 7.6 %
4,Manitoba,"$295,000",– 1.4 %
5,Saskatchewan,"$271,000",– 3.8 %
6,Nova Scotia,"$266,000",+ 3.5 %
7,Prince Edward Island,"$243,000",+ 3.0 %
8,Newfoundland / Labrador,"$236,000",– 1.6 %
9,New Brunswick,"$183,000",– 2.2 %
10,Canadian Average,"$488,000",– 1.3 %
11,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...,(adsbygoogle = window.adsbygoogle || []).push(...

In [12]:
del df['Bank customer id']
df

  Bank customer name  Net worth [$]  Years with bank
0              Steve         250000                3
1               Ryan           6890                4
2              Mitch           6543                9
3             Chanel          70000                5

In [13]:
df['Net worth [$]'].sum()

333433

In [15]:
df['new net']=df['Net worth [$]']+df['Net worth [$]']*.1
df

  Bank customer name  Net worth [$]  Years with bank   new net
0              Steve         250000                3  275000.0
1               Ryan           6890                4    7579.0
2              Mitch           6543                9    7197.3
3             Chanel          70000                5   77000.0

In [17]:
df['Net worth [$]']*=1.1
df

  Bank customer name  Net worth [$]  Years with bank   new net
0              Steve       275000.0                3  275000.0
1               Ryan         7579.0                4    7579.0
2              Mitch         7197.3                9    7197.3
3             Chanel        77000.0                5   77000.0

In [18]:
del df['new net']

In [19]:
df

  Bank customer name  Net worth [$]  Years with bank
0              Steve       275000.0                3
1               Ryan         7579.0                4
2              Mitch         7197.3                9
3             Chanel        77000.0                5

#### SORTING AND ORDERING

In [22]:
df.sort_values(by='Years with bank',inplace=True)
df

  Bank customer name  Net worth [$]  Years with bank
0              Steve       275000.0                3
1               Ryan         7579.0                4
3             Chanel        77000.0                5
2              Mitch         7197.3                9

#### CONCAT

In [27]:
df1=pd.DataFrame({'a':[1,2]
                ,'b':[4,5]})
df1

   a  b
0  1  4
1  2  5

In [29]:
df2=pd.DataFrame({'a':[4,6],
                 'b':[7,8]})
df2

   a  b
0  4  7
1  6  8

In [30]:
df3=pd.DataFrame({'a':[9,8],
                'b':[5,6]})
df3

   a  b
0  9  5
1  8  6

In [32]:
df4=pd.concat([df1,df2,df3])
df4

   a  b
0  1  4
1  2  5
0  4  7
1  6  8
0  9  5
1  8  6